{
  "course_categories": [
    {
      "id": 1,
      "name": "Bitcoin"
    },
    {
      "id": 2,
      "name": "Blockchain"
    },
    {
      "id": 3,
      "name": "Cryptocurrency"
    },
    {
      "id": 4,
      "name": "NFTs"
    },
    {
      "id": 5,
      "name": "DeFi"
    },
    {
      "id": 6,
      "name": "Trading"
    }
  ],
  "learns": [
    {
      "title": "What is Bitcoin?",
      "description": "Bitcoin is a revolutionary form of digital currency first proposed in 2008 by a person or group of people known as Satoshi Nakamoto.\r\n\r\nUnlike traditional currencies, Bitcoin is a digital asset and does not depend on central banks or governments.\r\n\r\nInstead, it operates as a completely decentralized system and stores activity on a digital database called the bitcoin ledger. This decentralization means that no single company or government can make decisions about how the currency works or how people can use it.\r\n\r\nIn fact, the protocol's users collectively help in running it, guided by strict computer-coded rules. These rules set the amount of bitcoin in circulation and how users trade and create new bitcoin.\r\n\r\nBitcoin (BTC), the cryptocurrency asset, was originally created to act as a digital medium of exchange. You can buy or sell bitcoin on most, if not all, crypto exchanges or on dedicated Bitcoin exchanges. The process of generating new Bitcoin is called Bitcoin mining. It involves using powerful crypto mining computers to process the complex mathematical equations needed to maintain the network.\r\n\r\nDuring the mining process, Bitcoin uses a system involving cryptography and game theory to validate and record transactions. The network stores these transactions on a public database system called a blockchain ledger.\r\n\r\nAs its essential building blocks, the Bitcoin protocol uses: \r\n\r\nPublic-key cryptography – Wallet software assigns bitcoin owners both a public key (which is used by the protocol to prove you own bitcoin) and a private key (a kind of password that, if secured well, guarantees your bitcoins can only be accessed by you).\r\nPeer-to-peer networking – Nodes (computers running the software) review transactions to ensure the software’s rules are being followed. Miners (nodes using special computer chips) then compete for the right to batch these transactions into the blocks periodically added to the blockchain.\r\nA finite supply – According to the software rules, only 21 million bitcoins can be produced, a limit that gives bitcoins value.",
      "category": 1,
      "slug": "what-is-bitcoin",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-bitcoin.png"
    },
    {
      "title": "What is the Bitcoin white paper?",
      "description": "The Bitcoin white paper provided an overview of how Satoshi Nakamoto’s ambitious protocol would work, including:\r\n\r\nHow bitcoin transactions work.\r\n\r\nHow network consensus and verification is achieved.\r\n\r\nHow the network is secured against attacks.\r\n\r\nThis document was akin to a technical constitution. It was a governing document for a new form of money that was stateless and completely decentralized.\r\n\r\nTransactions\r\nLeveraging existing techniques from cryptography and nascent blockchain ledger technology, Nakamoto asserted that it was possible to create a digital payment system that did not rely on a trusted intermediary. \r\n\r\nInstead, a peer-to-peer network of volunteers was proposed as a way to operate the system, similar to how a Tor network operates. This, coupled with digital signatures generated using complex mathematics and cryptographic algorithms would allow users to unequivocally prove their ownership of funds without revealing their sensitive information. \r\n\r\nRemarkably, bitcoin would also grant users the self-sovereign ability to approve their own transactions.\r\n\r\nNetwork Consensus\r\nIn order to allow users to approve their own transactions, without a trusted intermediary acting in the middle, there needed to be a system in place that prevents the processing of invalid transactions — namely double-spending the same funds.\r\n\r\nNakamoto dealt with this issue by incorporating a consensus mechanism pioneered by cryptographer and CEO of Blockstream, Adam Back. Consensus mechanisms are systems that encourage a group of distributed users, a majority of which do not know each other nor should in any way trust each other, to act honestly when agreeing on a single data entry.\r\n\r\nKnown as proof-of-work (PoW), Back’s mechanism requires users to invest their time and computing power to win a cryptography-based competition before they perform the all-important role of data validation. By forcing volunteers to have some skin in the game, the likelihood of them acting dishonestly was significantly reduced.\r\n\r\nNetwork Security\r\nNakamoto recognized that a peer-to-peer powered network can only be secure provided a majority of users act honestly based on the rules coded into the protocol. \r\n\r\nAs new blocks of transaction data are added to the blockchain and verified by at least 51% of the network, a single “honest” chain is created that everyone agrees is the true history of valid transactions. Even if attackers attempt to create their own invalid blocks, the rest of the network will reject them in favor of the longest chain.\r\n\r\nBut what if a majority of the Bitcoin blockchain is controlled by a single attacker, or a colluding group of attackers? This type of attack — known as a 51% attack — would grant attackers the power to change the order of, and even block, inbound transactions if they were able to outcompete the longest chain and replace it with their own.\r\n\r\nHowever, they would not be able to create new units of bitcoin at will or alter the issuance rate. These parameters are controlled by the protocol’s underlying code, not by network validators.\r\n\r\nNakamoto likened this to the Gambler’s Ruin problem, whereby unless attackers were consistently successful early on in their onslaught, it becomes increasingly unlikely they’d be able to pull off the attack and establish a longer chain.",
      "category": 1,
      "slug": "what-is-the-bitcoin-white-paper",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-bitcoin-white-paper.png"
    },
    {
      "title": "What is the Lightning Network?",
      "description": "The Lightning Network (also referred to as Lightning, or LN) is a scalability solution built on top of Bitcoin that allows users to quickly send and receive BTC with virtually no fees. \r\n\r\nLightning is considered to be an off-chain, Layer 2, solution, meaning that transfers are done via a new network of payment channels anchored in Bitcoin’s blockchain. \r\n\r\nAs the world’s first and leading cryptocurrency, Bitcoin has become an important means of transacting value because, for the first time, any holder has the freedom to:\r\n\r\nHold bitcoin without unexpected supply inflation \r\nSend and receive bitcoin without the need for an intermediary\r\nVerify transactions using their own nodes\r\n \r\nHowever, many agree that Bitcoin still needs better functionality in order to become a global medium of exchange and a peer-to-peer cash system as originally laid out in the seminal whitepaper Bitcoin: A Peer-to-Peer Electronic Cash System. Currently, Bitcoin faces the following limitations:\r\n\r\nFees – As block space is limited, mining fees can fluctuate wildly based on demand for transaction inclusion.\r\nTransactions per second – Bitcoin is only capable of approximately 7 transactions per second (TPS)\r\nNetwork congestion –  Slow block times and heightened use of the network can result in delays in transaction confirmations\r\n \r\nThe Bitcoin Lightning Network aims to solve these limitations by providing instant and inexpensive transactions while achieving a throughput of approximately 1 million transactions per second. \r\n\r\nWhile Lightning can be used for any type of transfer, most find it useful for micropayments or smaller transfers that are typically uneconomical due to base layer fees.\r\n\r\nAs of August 2021, Lightning Network stats show that more than 2,000 BTC have been transferred using the network. \r\n\r\nIt is important to note that the Lightning Network does not implement a new token and allows for the same freedoms as Bitcoin – it’s decentralized, permissionless, and open source. Its security derives from on-chain Bitcoin transactions, which use smart contracts to enable instant, off-chain settlements.",
      "category": 1,
      "slug": "what-is-the-lightning-network",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-lightning-network.png"
    },
    {
      "title": "What is blockchain technology?",
      "description": "A blockchain is a special type of online database system that distributes the process of storing data across a network of computers connected to the internet.\r\n\r\nEach computer stays in constant communication with others in the network, making tampering with information stored within their database or ledger nearly impossible. A ledger is another name for a centralized record of information – usually financial information like transaction data.\r\n\r\nHowever, a blockchain’s ability to maintain consensus among distributed computers means that they do not require the same sort of centralized oversight as traditional ledgers. \r\n\r\nThis is what makes blockchains decentralized. Developers program blockchain protocols to adhere to a strict set of rules. The protocol automatically issues financial incentives to those who follow the rules, and penalties to those who don’t. It is this programmatic usage of incentives that allows blockchains to operate without human management.",
      "category": 2,
      "slug": "what-is-blockchain-technology",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-blockchain-technology.png"
    },
    {
      "title": "What is a blockchain consensus mechanism?",
      "description": "A blockchain consensus mechanism is a type of automated system that aims to accomplish two main objectives.\r\n\r\nEnsure a distributed, leaderless community of network validators are able to efficiently and unanimously agree on new and existing data on the blockchain ledger.\r\n \r\nEnsure all network validators follow the rules of the protocol and perform their roles honestly.\r\nData validation refers to verifying new information is accurate and valid. This is incredibly important in a decentralized system, especially a decentralized monetary system. If invalid transaction information is allowed to be added to the blockchain such as a false balance or a double-spend transaction, it would completely undermine the integrity of that database.\r\n\r\nWithout an integral database, nobody would trust it and no one would use it.\r\n\r\nThere is also one other key problem that consensus mechanisms are used to solve: network security. \r\n\r\nSatoshi Nakamoto, the creator of Bitcoin, was the first to recognize that consensus mechanisms could also double up as an efficient system for deterring bad actors from attempting to take over the network through a majority attack (gaining control of more than 50% of a network.) This was a revolutionary innovation and one that helped cement the Bitcoin protocol as the first globally viable decentralized cryptocurrency.\r\n\r\nHow do consensus mechanisms work?\r\nWhile there are many types of consensus mechanisms used by different blockchains, most of them fundamentally work by requiring validator nodes to make some sort of investment and/or expend an amount of effort before they’re granted the right to propose and validate new blocks of data.\r\n\r\nThe idea behind this is simple. Validators who have invested their own time and money to participate in the network are theoretically less likely to try and corrupt it because they have something to lose if they do.\r\n\r\nIn short, consensus mechanisms are simply systems that encourage validators to abide by the rules through coercion (threat of punishment) and/or incentivization (earning rewards for good behavior).",
      "category": 2,
      "slug": "what-is-a-blockchain-consensus-mechanism",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-a-blockchain-consensus-mechanism.png"
    },
    {
      "title": "Proof-of-work vs. proof-of-stake",
      "description": "What is proof-of-work (PoW)?\r\nProof-of-work is a type of consensus mechanism that requires network users called “miners” to devote computing power to complete a task.\r\n\r\nThe proof-of-work (PoW) consensus mechanism debuted in the early 1990s as a system for preventing email spam. The method required users to solve a cryptographic problem before being able to send an email.\r\n\r\nFor legitimate users sending only a handful of emails, solving this single cryptographic puzzle was an easy task. However, for a dishonest actor looking to send spam emails en masse, the amount of computational power required made the venture far more costly.\r\n\r\nBitcoin and proof-of-work\r\nIn January 2009, the pseudonymous author of the bitcoin white paper, Satoshi Nakamoto, launched the Bitcoin protocol. This peer-to-peer electronic cash system featured an adapted version of the PoW mechanism to solve the aforementioned Byzantine Generals problem.\r\n\r\nThe PoW consensus mechanism used in the Bitcoin protocol incorporates a cryptography-based competition. Users compete for ​​the right to propose new entries in the ledger using their computers.\r\n\r\nThrough the bitcoin mining process, miners generate random, fixed-length codes called hashes. They create these hashes by running inputs at random through a cryptographic hashing algorithm. Doing so produces unique, 64 hexadecimal codes (codes only containing numbers from 0-9 and letters A-F).\r\n\r\nMiners generate hashes at random until one has the same or more zeros at the front compared to the target hash.\r\n\r\nThe target hash is a number set by the difficulty adjustment algorithm of the blockchain protocol.\r\n\r\nWhat is proof-of-stake (PoS)\r\nUnlike the outright competition of proof-of-work, proof-of-stake (PoS) uses a different set of incentives to make sure that network participants behave honestly.\r\n\r\nThree years after the launch of Bitcoin, two developers named Scott Nadal and Sunny King created the PoS consensus mechanism. Their main goal was to produce a more energy efficient system than proof-of-work.\r\n\r\nWith proof-of-stake (PoS), network participants purchase and lock away a protocol's native tokens to validate new blocks of transactions. In return, they can earn staking rewards (usually paid as interest on their staked assets).\r\n\r\nMany leading PoS blockchains such as Ethereum, Cardano, Algorand, and Polkadot employ their own selection algorithms to choose which stakers earn the right to propose new blocks.\r\n\r\nParticipants with more tokens staked are generally more likely to validate new blocks, but there is a degree of randomness programmed into these particular algorithms.\r\n\r\nThis randomization is designed to improve fairness and means all staking participants have a chance of earning rewards.",
      "category": 2,
      "slug": "proof-of-work-vs-proof-of-stake",
      "image": "..\\..\\..\\..\\media\\topic_images\\proof-of-work-vs-proof-of-stake.png"
    },
    {
      "title": "What is cryptocurrency?",
      "description": "Cryptocurrencies use concepts from cryptography, computer science, and economics. It is the combination of these three disciplines that allows cryptocurrencies to operate in a decentralized way.\r\n\r\nCryptographic techniques keep crypto transaction information secure. \r\nComputer science keeps this information consistent across all participants.\r\nEconomic incentives encourage everyone to follow the rules for the benefit of the network.\r\nCryptocurrency transactions share similarities to email messages. We no longer need a postal service to hand-deliver messages around the world. We can just send emails directly over the internet.\r\n\r\nCryptocurrency is the same. We no longer need a bank to hold and ferry our money around. We can hold cryptocurrency ourselves and send it directly to whoever we want.\r\nHow do you use cryptocurrency?\r\nJust as you don't need to understand mechanical engineering to drive a car, you don't need to study cryptography or economics to use crypto assets.\r\n\r\nAll you need is an internet connection and a device. Devices can be a smartphone, a laptop, a tablet, or a desktop computer. \r\n\r\nOnce you have those, you have several options to choose from when deciding to buy cryptocurrency. After you have bought your cryptocurrency, it is important to take some basic steps to keep your funds safe. Once you have bought your crypto and are keeping it safe using the method right for you, there are several ways to use cryptocurrency for different purposes.",
      "category": 3,
      "slug": "what-is-cryptocurrency",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-cryptocurrency.png"
    },
    {
      "title": "Crypto Coins and Tokens: What’s the Difference?",
      "description": "A crypto coin is the native asset of a blockchain protocol. This means the crypto coin serves as the medium of exchange for all transactions or smart contracts executed on that blockchain. Crypto coins exist on the base layer of a corresponding blockchain, rather than on a decentralized application (dApp) built on top of the blockchain.\r\n\r\nBecause they are the native cryptocurrency of a blockchain network, many think of these coins as \"Layer 1\" cryptocurrencies. While several different networks, applications, games or other types of protocols may run on top of these Layer 1 protocols, the Layer 1 chains serve as the foundation upon which other applications, and their associated crypto tokens, are built.\r\n\r\nCrypto coins typically bear the same or a similar name as their respective blockchains. For example, the bitcoin cryptocurrency exists on the Bitcoin blockchain and the ether cryptocurrency exists on the Ethereum blockchain.\r\n\r\nWhat are crypto tokens?\r\nCrypto tokens are digital assets built and deployed on top of a Layer 1 blockchain. In other words, crypto tokens are digital assets that are native to the products and services built on top of the so-called Layer 1 blockchains associated with crypto coins.\r\n\r\nEthereum is by far the most popular Layer 1 blockchain used for creating and launching crypto tokens. However, several other Layer 1 blockchains exist and serve as the foundation upon which crypto tokens can be built and deployed. \r\n\r\nFor example, within the Solana ecosystem, a variety of decentralized applications, games and services exist. Although each of these exist within the Solana ecosystem, they all have their own unique crypto token that serve a unique purpose within the given application. \r\n\r\nSome examples of crypto tokens that exist within the Solana ecosystem include:",
      "category": 3,
      "slug": "crypto-coins-and-tokens-whats-the-difference",
      "image": "..\\..\\..\\..\\media\\topic_images\\crypto-coins-and-tokens.png"
    },
    {
      "title": "How to keep your crypto safe",
      "description": "Since all cryptocurrency tokens are purely digital assets, there are no physical coins to stash in bank vaults or safety deposit boxes.\r\n\r\nInstead, access to any cryptocurrency you own is stored in digital wallets. These are usually software applications or physical devices akin to USB drives that are used to secure information regarding a user's funds.\r\n\r\nHow crypto wallets work\r\nBefore outlining the different types of wallets available to store cryptoassets and their pros and cons, it’s important to first understand how cryptocurrencies are actually secured.\r\n\r\nWhen a crypto wallet is generated, two mathematically-linked digital codes are created:\r\n\r\nA public key\r\nA private key\r\nThese two keys are used to prove ownership over assets held in a corresponding crypto wallet when sending those assets to other people.\r\n\r\nThe public key is run through a cryptographic hashing algorithm to generate a public wallet address. This turns the public key into a fixed-length alphanumeric code that is made available for anyone to see and can be used to receive inbound transactions in the same way a home address can be freely shared to receive inbound packages.\r\n\r\nIf you are interested in learning more about these concepts, you can check out our article How do cryptocurrencies use cryptography?\r\n\r\nA private key is the part that proves ownership of the funds and should never be shared with anyone, wihile the public key is ok to share. If the public key is like a home address, the private key should be thought of as a front door key. Only a homeowner should have access to their front door key, otherwise anyone could enter their home and steal the items inside.\r\n\r\nThis means that if a crypto wallet owner loses or forgets their private key, they can permanently lose access to their funds.\r\n\r\nIn the event the device where a crypto wallet is downloaded is lost, stolen or damaged, a backup code, usually referred to as a “seed phrase,” can be used to recover it onto a new device. Seed phrases must be generated before devices are compromised, and stored offline somewhere safe (more on that below).\r\n\r\nMuch like a private key, if another party manages to get hold of your seed phrase, they can duplicate your wallet onto any other device and drain your funds.",
      "category": 3,
      "slug": "how-to-keep-your-crypto-safe",
      "image": "..\\..\\..\\..\\media\\topic_images\\how-to-keep-your-crypto-safe.png"
    },
    {
      "title": "What is an NFT?",
      "description": "NFTs are blockchain-based digital records of ownership and authenticity associated with a piece of media.\r\n\r\nAn NFT is more than a multimedia file (like a .gif or .jpeg) ⁠— it is a public record of historic information associated with that media. In this way, NFTs are more similar to a painting’s bill of ownership and certificate of authenticity than the painted canvas itself.\r\n\r\nNFTs are different from fungible assets like $20 bills, shares of a stock, or other units which can be substituted for each other with no change in value.\r\n\r\nWhile one $20 bill is worth the same amount as any other $20 dollar bill and one new tennis ball can be exchanged for another without disrupting a match, NFTs have distinct qualities that make each unique and verifiably different from all other NFTs.\r\n\r\nWhy are NFTs important?\r\nAn NFT serves as proof of ownership, delivering a highly tamper-resistant way to mathematically verify that a certain blockchain address owns that item.\r\n\r\nAn NFT also serves as a certificate of authenticity which ensures that any form of media (artwork, document or other digital file) can be traced back to its origination (and thereby be proven not to have been tampered with since).",
      "category": 4,
      "slug": "what-is-an-nft",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-an-nft.png"
    },
    {
      "title": "How to buy an NFT",
      "description": "If you're interested in purchasing these unique blockchain tokens, there are several avenues available to you. While each method comes with its own unique tradeoffs, some methods open traders to different risks that you should understand before making your decision.\r\n\r\nThe most common ways to buy an NFT are:\r\n\r\nBuying them from secondary NFT marketplaces, like Kraken NFT\r\nParticipating in public mints and NFT pre-sales\r\nPeer-to-peer trading\r\nPurchasing NFTs on secondary NFT marketplaces\r\nFor NFT collections that have already dropped and are actively traded, secondary marketplaces are the most common and easiest to buy and sell NFTs. Many in the NFT space see secondary marketplaces as the safest, most secure, and easiest way to get started with NFTs.\r\n\r\nIn short, NFT marketplaces are similar to crypto exchanges in that they match NFT buyers with NFT sellers around the world.\r\n\r\nKraken NFT is one such example of a secondary NFT marketplace for buying and selling digital collectibles. Many secondary NFT marketplaces offer a variety of different payment options, which allows you to:\r\n\r\nBuy an NFT with cash\r\nBuy an NFT with cryptocurrency\r\nBuy an NFT with a credit card or debit card\r\nAfter doing your own research and finding the right NFT for you, you’ll also need to find an NFT marketplace you can trust. After that, the buying process can be just as straightforward as any other online purchase. \r\n\r\nFollow the steps below to buy an NFT on a secondary NFT marketplace.\r\n\r\nCreate an account:\r\nSign up for an account on the marketplace of your choice. Provide the necessary information and complete any verification steps that may be required.\r\nThe sign up process varies depending on which NFT marketplace you choose to use.\r\n \r\nConnect your crypto wallet:\r\nMany decentralized marketplaces simply require you to connect your software wallet to the platform to begin trading. You will often find a \"connect\" button located in the top right-hand corner of the marketplace home page. After clicking it, you will be presented with a range of supported options. Coinbase Wallet and MetaMask are popular wallet options.\r\nIt’s worth noting that Kraken NFT does not require you to connect your crypto wallet in order to buy an NFT.\r\n \r\nFund your wallet:\r\nFor many marketplaces, you will need to hold a specific type of cryptocurrency in your wallet. This cryptocurrency is often associated with the NFT’s blockchain network. You’ll need this asset to both purchase the NFT and cover transaction costs associated with maintaining the network, known as gas fees.\r\nYou can buy this cryptocurrency from a range of crypto platforms, mobile apps, and peer-to-peer services, such as Kraken. But, on some marketplaces such as Kraken NFT, you can purchase an NFT with any of the hundreds of cryptocurrencies and fiat currencies we offer. This simplifies the NFT buying process and allows you to pay your way for your NFT.\r\n \r\nMake the purchase:\r\nIf you're satisfied with the NFT and its price, click the \"Buy\" button or follow the platform's purchasing process.\r\nNext, confirm the transaction details and authorize the payment from your wallet. Rather than using the cryptocurrency in your wallet, you can also purchase an NFT using a credit card.\r\nAlternatively, you can place a lower bid than the asking price on a specific NFT, or any NFT in a collection (collection bid). The owner of the NFT can then choose to accept your bid.",
      "category": 4,
      "slug": "how-to-buy-an-nft",
      "image": "..\\..\\..\\..\\media\\topic_images\\how-to-buy-an-nft.png"
    },
    {
      "title": "What is an NFT rarity ranking?",
      "description": "There are many ways to calculate an NFT's rarity, each of which will result in a different score. \r\n\r\nSome methodologies determine overall rarity by taking the average rarity of each trait expressed within an NFT. Other methods consider only the rarest trait, ignoring the scarcity of all other traits. Some multiply the rarity values of all the traits shown within an NFT by each other. \r\n\r\nUltimately, these methods offer incomplete assessments and different results. Some methods overweight the rarity of all traits within a collection, failing to properly account for the extreme rarity of certain outlier traits. Others provide an incomplete picture by focusing solely on an NFT’s rarest trait, assigning lesser importance to other traits that are also rare.\r\n\r\nKraken NFT solves these problems by using a formula that weights the number of NFTs in a collection that have a given trait against the total number of NFTs in the collection.\r\n\r\nThe sum of the rarity values for all of an NFT’s traits results in an overall rarity score, which is ranked against the other NFTs in the collection. \r\n\r\nKraken NFT offers a built-in rarity ranking based on the uniqueness of an NFT’s rarest individual trait while also weighting the combined rarity of the full NFT — a holistic approach that avoids over or underweighting the final metric.",
      "category": 4,
      "slug": "what-is-an-nft-rarity-ranking",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-an-nft-rarity-ranking.png"
    },
    {
      "title": "What is DeFi?",
      "description": "There are three key components to decentralized financial applications:\r\n\r\nA public blockchain\r\nCryptocurrency\r\nSmart contracts\r\nBlockchain\r\nBlockchain technology provides a distributed, transparent ledger system for recording all dApp-related data. Its own community of volunteer participants, called \"nodes,\" manage each blockchain. Nodes are distributed across the globe and can be anyone in the world.\r\n\r\nNodes use their computers to perform key tasks such as storing and validating new dApp transactions and smart contract data. Nodes all adhere to strict rules coded into each blockchain's protocol.\r\n\r\nIf you want to learn even more about how blockchains work, you can check out our Kraken Learn Center article What is blockchain technology?\r\n\r\nRather than building a blockchain from scratch for each new dApp, many developers build their applications on top of existing blockchain networks.\r\n\r\nThis move saves time and money, and allows dApps to be interoperable with other applications built on the same chain. More established blockchain networks also offer greater security and large communities of users than newly created networks.\r\n\r\nEthereum, Solana, Polkadot, and Cardano are some of the largest blockchains supporting DeFi services today.\r\n\r\nCryptocurrency\r\nNative crypto tokens often power these blockchain networks and incentivize users to participate in running them.\r\n\r\nIf you want to learn even more about how cryptocurrencies work, you can check out our Kraken Learn Center article What is a cryptocurrency?\r\n\r\nUsers must pay fees denominated in the underlying blockchain's native cryptocurrency to perform any dApp-related activities.\r\n\r\nFor dApps built on Ethereum, users pay fees in ether (ETH). With Cardano, fees are denominated in the platform’s native Ada (ADA) cryptocurrency, and so on.\r\n\r\nIn some instances, these tokens can have additional utilities. For example, governance tokens are a types of cryptocurrency that grant holders weighted voting powers over the protocol's management and future direction.\r\n\r\nSmart contracts\r\ndApps achieve their autonomy by using smart contracts instead of human intermediaries. Smart contracts are self-executing computer programs that automatically fulfill contract obligations between two parties when predetermined factors are met.\r\n\r\nIf you want to learn even more about how smart contracts work, you can check out our Kraken Learn Center article What is a smart contract?\r\n\r\nSmart contract programs are stored on blockchains. Smart contract platforms like Ethereum use simulated computer environments called virtual machines to read and execute these special types of programs.\r\n\r\nNodes run the virtual machine program when validating transactions involving smart contracts. The virtual machine makes sure smart contracts deployed on the blockchain produce valid transactions per the rules of the protocol.\r\n\r\nA great example of a dApp in practice is the DAI DeFi application.\r\n\r\nDAI allows users to \"lock\" cryptocurrency into a smart contract running on the Ethereum blockchain. Users deposit these funds as collateral to generate new DAI tokens that power its lending service. Users can take these newly minted DAI tokens and trade with them or deploy them on other DeFi platforms to earn yields. This project provides liquidity to investors without them having to directly dispose of their ETH.\r\n\r\nWhen the user wishes to retrieve their locked assets, they simply return the DAI and pay a small interest fee.",
      "category": 5,
      "slug": "what-is-defi",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-defi.png"
    },
    {
      "title": "How does DeFi work?",
      "description": "Decentralized finance (DeFi) has emerged as one of the crypto economy's most important and active sectors. \r\n\r\nCombining smart contracts and a range of decentralized applications, DeFi has paved the way for entirely new types of financial service that operate autonomously, without the need for trusted intermediaries.\r\n\r\nJust a few years after the Bitcoin white paper showed the viability of blockchain technology, protocols have already had a profound impact on the financial services industry. \r\n\r\nCrypto holders are now using DeFi protocols to generate additional yields on their assets. Unbanked citizens in developing countries are using DeFi to access important services such as loans and insurance.\r\n\r\nEven if you understand the importance of cryptocurrency, you may still be wondering how these DeFi protocols work. So let's dive in.\r\n\r\nDeFi relies heavily on blockchain technology, which is essentially a decentralized and immutable digital ledger that records all transactions and smart contract data across a network. Ethereum and Solana, two of the most popular blockchains for DeFi, play a crucial role in these financial services thanks to their ability to support smart contracts.",
      "category": 5,
      "slug": "how-does-defi-work",
      "image": "..\\..\\..\\..\\media\\topic_images\\how-does-defi-work.png"
    },
    {
      "title": "What is a liquidity pool and how to use one?",
      "description": "Liquidity pools are one of the integral components of decentralized finance (DeFi) that allow decentralized exchanges (DEXs) to operate without the need for intermediaries.\r\n\r\nOn centralized exchanges, there is a third-party managed order book system that lists all buyer \"bid\" orders and seller \"ask\" orders. Matching software then connects traders with suitable counterparties on the other side of the order book to fulfill orders. \r\n\r\nDepending on liquidity, market conditions, and other factors, orders can take time to fill and may be filled at a slightly different price.\r\n\r\nMany DEXs on the other hand utilize special community-funded liquidity pools to address this shortcoming. These pools act as reserves of assets that other users can trade against. \r\n\r\nSmart contracts facilitate all trades executed within the pool, meaning there are no direct counterparties to deal with. The pools take the place of the counterparties and supply instant liquidity when needed.\r\n\r\nThe overarching term for these types of decentralized finance (DeFi) platforms is Automated Market Maker (AMM) protocols.\r\n\r\nLiquidity providers (LPs)\r\nEach liquidity pool represents a collection of funds locked into a smart contract by voluntary depositors. These depositors are known as \"liquidity providers\" or \"LPs.\"\r\n\r\nAnyone can become a liquidity provider by following a few simple steps, which we'll explore here.\r\n\r\nEach liquidity pool usually contains a specific pair of cryptocurrencies for other DEX users to trade against. For example, DEX customers looking to trade ether (ETH) for USD Coin (USDC) will need to locate an ETH/USDC liquidity pool on the platform.\r\n\r\nIn exchange for providing cryptoassets, LPs receive an amount of LP tokens that represent their share of assets within the pool. LP token holders earn a proportional share of all transaction fees charged to traders that use the pool.\r\n\r\nIn some cases, holders can lock their LP tokens in other DeFi platforms to generate additional yields. This strategy is known as \"yield farming.\"\r\n\r\nMost DEX platforms allow LPs to withdraw their assets from the pool at any time. This process simply involves redeeming LP tokens for the deposited cryptoassets. Upon redemption, the liquidity pool smart contract burns the LP tokens which permanently destroys them. The DEX then transfers the assets back to the user's crypto wallet.",
      "category": 5,
      "slug": "what-is-a-liquidity-pool-and-how-to-use-one",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-a-liquidity-pool-and-how-to-use-one.png"
    },
    {
      "title": "A brief introduction to technical analysis",
      "description": "Technical analysis (TA) is the practice of evaluating past financial data and trends in an effort to predict future price movements.\r\n\r\nThe main assumption of technical analysis is that market trends — including price levels and movements, as well as trading volume and momentum — tend to repeat over time. Because of this, different market events can create trading signals that indicate different buying and selling opportunities.\r\n\r\nIn order to identify trading signals, technical analysts use candlestick charts, financial indicators and other technical tools to identify the various patterns and trends that may suggest future price changes.\r\n\r\nWhile technical analysis is widely used by professional traders and investors, it is not without its limitations. Critics argue that it relies too heavily on historical data and may not take into account fundamental factors that can affect market movements. Some of these factors include variables such as marco-economic trends, geopolitical events, regulations, and industry trends. Hence, when developing a trading strategy using technical analysis, it is important to keep the famous financial phrase \"past performance is no guarantee of future results\" in mind.\r\n\r\nSupport and resistance\r\nSupport and resistance levels are two important concepts in technical analysis:\r\n\r\nSupport is a level that prices do not drop below. Support levels act as a price 'floor' or lowest price level consistently reached during a given trading period or market cycle. Despite prices hitting a support level multiple times, it acts as a place where buyers outnumber sellers.\r\nResistance is a level that prices do not exceed. Resistance levels act as a price 'ceiling' or highest price level consistently reached during a given trading period or market cycle. Despite prices reaching a resistance level multiple times, it represents a place where sellers outnumber buyers.\r\nIn TA, the more times a particular asset’s price \"tests\" a support or resistance level, the stronger that level is considered to be. In other words, the more times a price reaches, but does not cross the line, the more likely it is that this line will hold as a short-term price minimum or maximum.",
      "category": 6,
      "slug": "a-brief-introduction-to-technical-analysis",
      "image": "..\\..\\..\\..\\media\\topic_images\\a-brief-introduction-to-technical-analysis.png"
    },
    {
      "title": "What are crypto futures contracts?",
      "description": "A crypto futures contract is an agreement between two parties to exchange the fiat-equivalent value of a cryptoasset, or the asset itself, on a future date.\r\n\r\nMany think of futures as two people betting on the future price of an asset such as Bitcoin (BTC) or Ether (ETH). One person believes the price of the asset will be higher at an agreed date in the future. This view is known as going long.The other person thinks it will be lower by the agreed date. This view is known as going short.\r\n\r\nIn crypto futures trading, a trader profits if their price prediction about a contract's underlying digital asset comes true. If a trader believes the price will increase, they can go long on a futures contract, with the aim of selling it later at a higher price. If they believe the price will decline, they can go short. The shorting process involves selling a contract they don't own with the intent of buying it back later at a lower price (and trying to profit from the difference).\r\n\r\nFutures exchanges match the buyer with the seller of each futures contract, meaning platforms like Kraken Pro are not a counterparty to any futures trade. Additionally, the \"loser\" of the bet must pay the difference between the settlement price and the underlying asset's current spot market price to the \"winner.\"\r\n\r\nCrypto futures contracts are one of the most popular types of crypto derivatives available to crypto traders. Derivatives have grown into a significant part of the global cryptocurrency economy. Crypto derivatives now account for more than half of all crypto trading volume, which equates to billions of dollars each day.",
      "category": 6,
      "slug": "what-are-crypto-futures-contracts",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-are-crypto-future-contracts.png"
    },
    {
      "title": "What is dollar cost averaging (DCA)?",
      "description": "Dollar-cost averaging (DCA) refers to a simple, beginner-friendly investment strategy whereby a person makes small, regularly scheduled investments in a particular asset over a period of time, instead of investing the entire sum at once.\r\n\r\nThe main idea behind this method is that by purchasing small amounts of an asset at regular intervals, the impact of short-term volatility can be minimized.\r\n\r\nTo implement this strategy, all an investor needs to do is create a plan to purchase a fixed fiat amount of a particular asset at a predefined interval. For example, an investor with $1,000 can create a simple DCA plan whereby they commit to purchasing $50 worth of bitcoin at the same time every month for twenty months in a row, rather than a single $1,000 purchase.\r\n\r\nTiming the crypto market\r\nMost financial markets go through four cycles:\r\n\r\nAccumulation: when buying momentum begins to pick back up after a prolonged period of selling. This is seen as the first stage of a recovering market.\r\nMarkup: when more buyers enter the market – typically those who are less risk averse and have been waiting for stronger conviction in the market.\r\nDistribution: when profit taking begins and selling pressure starts to build.\r\nMarkdown: when sellers overpower buyers, confidence in the market breaks down and prices fall.\r\nPredicting and capitalizing on each of these market cycles can be difficult, if not impossible, for most investors. This means many often have a hard time predicting exactly when to buy and sell assets in order to maximize their potential gains. \r\n\r\nFor investors with a longer investment horizon, DCA addresses this challenge by allowing them to constantly accumulate an asset they believe has long term potential, regardless of its short term price changes.\r\n\r\nDCA has the added benefit of removing several emotional aspects of trading as well as the headaches that come with attempting to perfectly time each and every market movement.\r\n\r\nDollar-Cost Averaging Bitcoin & Crypto\r\nDCA can prove particularly useful when investing in cryptocurrencies, a historically volatile asset class that trades 24/7 on the global markets. \r\n\r\nIn a falling market, dollar-cost averaging can often result in reduced losses during the downturn and often better gains as the market improves.\r\n\r\nFor example, an investor who made a single $11,500 investment at the start of 2022 would have $7,400 in their trading account at the start of June 2022, a loss of over 35%. This contrasts to a 0.72% loss, with $11,400 in their account, had the investor used the DCA strategy and purchased $500 of bitcoin per week over the same time frame.\r\n\r\nAdditionally, dollar-cost averaging over a period of many years can provide better returns than making a single investment. Let’s assume an investor made $5 investments in bitcoin every week for the last four years.  By Jan. 1, 2022, they would have made a 460% return using the DCA strategy compared to a 243% return had they made a single investment – a difference of 217%.",
      "category": 6,
      "slug": "what-is-dollar-cost-averaging-dca",
      "image": "..\\..\\..\\..\\media\\topic_images\\what-is-dollar-cost-averaging_2Bdnn9L.png"
    }
  ]
}